In [4]:
import os
import pandas as pd
os.chdir(r"C:\Users\Pc\Desktop\Data Science Notes\IRIS")

In [9]:
data_csv = pd.read_csv('Iris_data_sample.csv')

In [11]:
data_csv

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,??,3.1,1.5,0.2,Iris-setosa
4,5,5,3.6,###,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [12]:
data_csv = pd.read_csv('Iris_data_sample.csv', index_col=0)

In [13]:
data_csv

    SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm         Species
1             5.1           3.5           1.4           0.2     Iris-setosa
2             4.9           NaN           1.4           0.2             NaN
3             4.7           3.2           1.3           0.2     Iris-setosa
4              ??           3.1           1.5           0.2     Iris-setosa
5               5           3.6           ###           0.2     Iris-setosa
..            ...           ...           ...           ...             ...
146           6.7           3.0           5.2           2.3  Iris-virginica
147           6.3           2.5             5           1.9  Iris-virginica
148           6.5           3.0           5.2           2.0  Iris-virginica
149           6.2           3.4           5.4           2.3  Iris-virginica
150           5.9           3.0           5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [16]:
data_csv = pd.read_csv('Iris_data_sample.csv', index_col=0, na_values=["??"])
data_csv.head(10)

    SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
1             5.1           3.5           1.4           0.2  Iris-setosa
2             4.9           NaN           1.4           0.2          NaN
3             4.7           3.2           1.3           0.2  Iris-setosa
4             NaN           3.1           1.5           0.2  Iris-setosa
5             5.0           3.6           ###           0.2  Iris-setosa
6             5.4           3.9           NaN           0.4  Iris-setosa
7             4.6           3.4           1.4           0.3  Iris-setosa
8             5.0           3.4           1.5           0.2  Iris-setosa
9             4.4           2.9           1.4           0.2  Iris-setosa
10            4.9           3.1           1.5           0.1  Iris-setosa

In [17]:
data_csv = pd.read_csv('Iris_data_sample.csv', index_col=0, na_values=["??","###"])
data_csv.head(10)

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9           NaN            1.4           0.2          NaN
3             4.7           3.2            1.3           0.2  Iris-setosa
4             NaN           3.1            1.5           0.2  Iris-setosa
5             5.0           3.6            NaN           0.2  Iris-setosa
6             5.4           3.9            NaN           0.4  Iris-setosa
7             4.6           3.4            1.4           0.3  Iris-setosa
8             5.0           3.4            1.5           0.2  Iris-setosa
9             4.4           2.9            1.4           0.2  Iris-setosa
10            4.9           3.1            1.5           0.1  Iris-setosa

In [22]:
data_csv = pd.read_excel('Iris_data_sample.xlsx',sheet_name='Iris_data', index_col=0, na_values=["??","###"])
data_csv

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9           NaN            1.4           0.2             NaN
3              4.7           3.2            1.3           0.2     Iris-setosa
4              NaN           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            NaN           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [31]:
data_csv = pd.read_table ('Iris_data_sample.txt', index_col=0, na_values=["??"],delimiter=" ")
#data_csv = pd.read_csv ('Iris_data_sample.txt', index_col=0, na_values=["??"],delimiter=" ")
data_csv

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
146,146,6.7,3.0,5.2,2.3,Iris-virginica
147,147,6.3,2.5,5.0,1.9,Iris-virginica
148,148,6.5,3.0,5.2,2.0,Iris-virginica
149,149,6.2,3.4,5.4,2.3,Iris-virginica
150,150,5.9,3.0,5.1,1.8,Iris-virginica

In [35]:
cars_data = pd.read_csv('Toyota.csv',index_col=0)
cars_data

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [36]:
cars_data.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [40]:
cars_data.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [41]:
cars_data.shape

(1436, 10)

In [43]:
cars_data.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [44]:
cars_data.ndim

2

In [54]:
cars_data.head(5)

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

In [49]:
cars_data.tail(10)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1426,9950,78.0,30964,Petrol,110,NaN,1,1600,3,1080
1427,8950,NaN,29000,Petrol,86,1.0,1,1300,3,1045
1428,8450,72.0,??,Petrol,86,NaN,0,1300,3,1015
1429,8950,78.0,24000,Petrol,86,1.0,1,1300,5,1065
1430,8450,80.0,23000,Petrol,86,0.0,0,1300,3,1015
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [56]:
cars_data.at[1434,'FuelType']

nan

In [60]:
cars_data.iat[1434,2]

'??'

In [121]:
cars_data.loc[:,['FuelType']]

     FuelType
0      Diesel
1      Diesel
2      Diesel
3      Diesel
4      Diesel
...       ...
1431   Petrol
1432   Petrol
1433   Petrol
1434      NaN
1435   Petrol

[1436 rows x 1 columns]

In [63]:
cars_data.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [68]:
#cars_data.get_dtype_counts()
cars_data.dtypes.value_counts()

object     4
int64      4
float64    2
dtype: int64

In [69]:
cars_data.select_dtypes(exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [70]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1436 non-null object
FuelType     1336 non-null object
HP           1436 non-null object
MetColor     1286 non-null float64
Automatic    1436 non-null int64
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(2), int64(4), object(4)
memory usage: 163.4+ KB

In [2]:
import numpy as np
np.unique(cars_data['KM'])

NameError: name 'cars_data' is not defined

In [74]:
np.unique(cars_data['HP'])

array(['107', '110', '116', '192', '69', '71', '72', '73', '86', '90',
       '97', '98', '????'], dtype=object)

In [75]:
np.unique(cars_data['Automatic'])

array([0, 1], dtype=int64)

In [76]:
np.unique(cars_data['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

In [85]:
cars_data1 = pd.read_csv('Toyota.csv',index_col=0, na_values=['??','????'])
cars_data1

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110.0,0.0,0,1600,5,1114

In [86]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1421 non-null float64
FuelType     1336 non-null object
HP           1430 non-null float64
MetColor     1286 non-null float64
Automatic    1436 non-null int64
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [91]:
cars_data1['MetColor'] = cars_data1['MetColor'].astype('object')

In [92]:
cars_data1['Automatic'] = cars_data1['Automatic'].astype('object')

In [93]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1421 non-null float64
FuelType     1336 non-null object
HP           1430 non-null float64
MetColor     1286 non-null object
Automatic    1436 non-null object
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

In [94]:
cars_data1['FuelType'].nbytes

11488

In [96]:
cars_data1['FuelType'].astype('category').nbytes

1460

In [97]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1421 non-null float64
FuelType     1336 non-null object
HP           1430 non-null float64
MetColor     1286 non-null object
Automatic    1436 non-null object
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

In [100]:
print("Unique values of Doors column:",np.unique(cars_data1['Doors']))

Unique values of Doors column: ['2' '3' '4' '5' 'five' 'four' 'three']

In [111]:
cars_data1['Doors'].replace('three',3,inplace=True)
cars_data1['Doors'].replace('four',4,inplace=True)
cars_data1['Doors'].replace('five',5,inplace=True)

In [116]:
cars_data1['Doors'] = cars_data1['Doors'].astype('int64')
print(np.unique(cars_data1['Doors']))

[2 3 4 5]

In [118]:
cars_data1.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [119]:
cars_data1.insert(10,"Price Class","")

In [126]:
for i in range(0,len(cars_data1['Price']),1):
    if(cars_data1['Price'][i]<8450):
        cars_data.at[i,'Price Class']='Low'
    elif(cars_data1['Price'][i]>11950):
        cars_data.at[i,'Price Class']='High'
    else:
        cars_data.at[i,'Price Class']='Medium'

In [127]:
cars_data1

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price Class
0,13500,23.0,46986.0,Diesel,90.0,1,0,2000,3,1165,High
1,13750,23.0,72937.0,Diesel,90.0,1,0,2000,3,1165,High
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High
3,14950,26.0,48000.0,Diesel,90.0,0,0,2000,3,1165,High
4,13750,30.0,38500.0,Diesel,90.0,0,0,2000,3,1170,High
...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1,0,1300,3,1025,Low
1432,10845,72.0,NaN,Petrol,86.0,0,0,1300,3,1015,Medium
1433,8500,NaN,17016.0,Petrol,86.0,0,0,1300,3,1015,Medium
1434,7250,70.0,NaN,NaN,86.0,1,0,1300,3,1015,Low
1435,6950,76.0,1.0,Petrol,110.0,0,0,1600,5,1114,Low

In [128]:
cars_data1['Price Class'].value_counts()

Medium    770
Low       350
High      316
Name: Price Class, dtype: int64

In [129]:
cars_data1.insert(11,"Age_Converted",0)

In [130]:
def c_convert(val):
    return val/12

In [131]:
cars_data1['Age_Converted']=c_convert(cars_data1['Age'])

In [132]:
cars_data1

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price Class,Age_Converted
0,13500,23.0,46986.0,Diesel,90.0,1,0,2000,3,1165,High,1.916667
1,13750,23.0,72937.0,Diesel,90.0,1,0,2000,3,1165,High,1.916667
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.000000
3,14950,26.0,48000.0,Diesel,90.0,0,0,2000,3,1165,High,2.166667
4,13750,30.0,38500.0,Diesel,90.0,0,0,2000,3,1170,High,2.500000
...,...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1,0,1300,3,1025,Low,NaN
1432,10845,72.0,NaN,Petrol,86.0,0,0,1300,3,1015,Medium,6.000000
1433,8500,NaN,17016.0,Petrol,86.0,0,0,1300,3,1015,Medium,NaN
1434,7250,70.0,NaN,NaN,86.0,1,0,1300,3,1015,Low,5.833333
1435,6950,76.0,1.0,Petrol,110.0,0,0,1600,5,1114,Low,6.333333

In [133]:
cars_data1['Age_Converted']=round(cars_data1['Age_Converted'],1)

In [134]:
cars_data1

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price Class,Age_Converted
0,13500,23.0,46986.0,Diesel,90.0,1,0,2000,3,1165,High,1.9
1,13750,23.0,72937.0,Diesel,90.0,1,0,2000,3,1165,High,1.9
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.0
3,14950,26.0,48000.0,Diesel,90.0,0,0,2000,3,1165,High,2.2
4,13750,30.0,38500.0,Diesel,90.0,0,0,2000,3,1170,High,2.5
...,...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1,0,1300,3,1025,Low,NaN
1432,10845,72.0,NaN,Petrol,86.0,0,0,1300,3,1015,Medium,6.0
1433,8500,NaN,17016.0,Petrol,86.0,0,0,1300,3,1015,Medium,NaN
1434,7250,70.0,NaN,NaN,86.0,1,0,1300,3,1015,Low,5.8
1435,6950,76.0,1.0,Petrol,110.0,0,0,1600,5,1114,Low,6.3

In [135]:
cars_data1.insert(12,"Km_per_month",0)

In [136]:
def c_convert(val1,val2):
    val_converted = val1 / 12
    ratio = val2 / val1
    return [val_converted, ratio]

In [137]:
cars_data1['Age_Converted'],cars_data1['Km_per_month'] = c_convert(cars_data1['Age'], cars_data1['KM'])
#we have used the function c_convert() to calculate the KM per month and converted Age from months to years
#and stored in Age_converted column

In [138]:
cars_data1

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price Class,Age_Converted,Km_per_month
0,13500,23.0,46986.0,Diesel,90.0,1,0,2000,3,1165,High,1.916667,2042.869565
1,13750,23.0,72937.0,Diesel,90.0,1,0,2000,3,1165,High,1.916667,3171.173913
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.000000,1737.958333
3,14950,26.0,48000.0,Diesel,90.0,0,0,2000,3,1165,High,2.166667,1846.153846
4,13750,30.0,38500.0,Diesel,90.0,0,0,2000,3,1170,High,2.500000,1283.333333
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1,0,1300,3,1025,Low,NaN,NaN
1432,10845,72.0,NaN,Petrol,86.0,0,0,1300,3,1015,Medium,6.000000,NaN
1433,8500,NaN,17016.0,Petrol,86.0,0,0,1300,3,1015,Medium,NaN,NaN
1434,7250,70.0,NaN,NaN,86.0,1,0,1300,3,1015,Low,5.833333,NaN
1435,6950,76.0,1.0,Petrol,110.0,0,0,1600,5,1114,Low,6.333333,0.013158

# Jose Portilla

In [5]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [8]:
pd.Series(data =my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data =my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
d

{'a': 10, 'b': 20, 'c': 30}

In [16]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [17]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [18]:
pd.Series(data= [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [20]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [25]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [27]:
ser1['USA']

1

In [28]:
ser3 = pd.Series(data = labels)

In [29]:
ser3[0]

'a'

In [30]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [31]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [32]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

## DataFrame

In [186]:
from numpy.random import randn
np.random.seed(101)

In [187]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [188]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [189]:
df[["W",'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [190]:
df['new'] = df['W']+df['Y']

In [191]:
df.drop('new', axis=1, inplace=True)

In [192]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [193]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [194]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [195]:
df.shape

(5, 4)

In [196]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [197]:
df.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [198]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [199]:
df.loc['B','Y']

-0.8480769834036315

In [200]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [201]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [202]:
booldf = df > 0

In [203]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [204]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [205]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [206]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [207]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [208]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [209]:
resultdf = df[df['W']>0]

In [210]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [211]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [212]:
boolser = df['W']>0

In [213]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [214]:
result = df[boolser]

In [215]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [216]:
mycol = ['Y','X']
result[mycol]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [217]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [218]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [219]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [220]:
newind ="CA NY WY OR SD".split()

In [221]:
newind

['CA', 'NY', 'WY', 'OR', 'SD']

In [222]:
df['States'] = newind

In [223]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     SD

In [224]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
SD      0.190794  1.978757  2.605967  0.683509

In [225]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     SD

# DataFrame 3

In [226]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [227]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [228]:
inside

[1, 2, 3, 1, 2, 3]

In [229]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [230]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [231]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [232]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [233]:
df.index.names = ['Groups','Num']

In [234]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [235]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [236]:
df.loc['G1'].loc[1]['A']

0.3026654485851825

In [237]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [239]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [240]:
df = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [241]:
df = pd.DataFrame(df)

In [243]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [245]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [263]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [264]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [267]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group-by

In [268]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [269]:
df =pd.DataFrame(data)

In [270]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [272]:
byComp = df.groupby('Company')

In [275]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [278]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [279]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [280]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [281]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [282]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [288]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## operations

In [290]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']
                   })
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [291]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [294]:
df['col2'].nunique() #Or len(df['col2'].unique())

3

In [296]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [299]:
df[(df['col1']>2) & (df['col2']==444) ]

   col1  col2 col3
3     4   444  xyz

In [300]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [301]:
def times2(x):
    return x*2

In [302]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [303]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [307]:
df['col2'].apply(lambda x: x*2 )

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [308]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [311]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [312]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [317]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [318]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [319]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1],
       }
df=pd.DataFrame(data)

In [320]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [328]:
df.pivot_table(values = 'D', index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN